<!DOCTYPE html>
<html lang="fr">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=US-ASCII">
<meta name="generator" content="hevea 2.35">
<link rel="stylesheet" type="text/css" href="to-1sn-2023-deroulement-corrige.css">
<title>Projet long</title>
</head>
<body >
<a href="to-1sn-2023-deroulement-corrige029.html"><img src="previous_motif.svg" alt="Previous"></a>
<a href="to-1sn-2023-deroulement-corrige-index.html"><img src="contents_motif.svg" alt="Up"></a>
<a href="to-1sn-2023-deroulement-corrige031.html"><img src="next_motif.svg" alt="Next"></a>
<hr>
<h3 id="sec82" class="subsection">1.3.3&#X2003;Projet long</h3>
<p>Nous vous proposons de d&#XE9;finir vous-m&#XEA;mes le sujet du projet long
sur lequel vous allez travailler. Vous trouverez ici les principales
consignes et les jalons de ce projet.</p><p><span style="font-weight:bold">Rappel :</span> Ce projet sert de support &#XE0; la mati&#XE8;re <em>Gestion de
projet / M&#XE9;thodes agiles (SCRUM)</em> de l&#X2019;UE SHS et sera &#XE9;valu&#XE9; aussi bien par
TOB (Projet Long) que par Gestion de projet. Vous aurez donc 2 notes.</p>
<h4 id="sec83" class="subsubsection">Constitution des &#XE9;quipes</h4>
<p>Une &#XE9;quipe (un groupe de projet) doit &#XEA;tre constitu&#XE9;e au sein d&#X2019;un m&#XEA;me groupe
de TD (tous les membres d&#X2019;une &#XE9;quipe doivent appartenir au m&#XEA;me groupe de TD).</p><p>Il y aura 4 &#XE9;quipes par groupe de TD.
Ceci fera donc des &#XE9;quipes de 7 personnes, plus ou moins une.</p><p>Vous ne pouvez pas faire partie de la m&#XEA;me &#XE9;quipe de TOB si vous &#XE9;tiez d&#XE9;j&#XE0;
dans une m&#XEA;me &#XE9;quipe en PIM.</p><p>Chaque &#XE9;quipe sera suivie par un enseignant qui est son enseignant de TD TOB :
</p><ul class="itemize"><li class="li-itemize">
AB : Xavier Cr&#XE9;gut <a href=""><span style="font-family:monospace">&lt;prenom.nom@toulouse-inp.fr&gt;</span></a>
</li><li class="li-itemize">CD : Judicael Bedouet <a href=""><span style="font-family:monospace">&lt;prenom.nom@onera.fr&gt;</span></a>
</li><li class="li-itemize">EF : Meriem Ouederni <a href=""><span style="font-family:monospace">&lt;prenom.nom@toulouse-inp.fr&gt;</span></a>
</li><li class="li-itemize">GH : Xavier Cr&#XE9;gut <a href=""><span style="font-family:monospace">&lt;prenom.nom@toulouse-inp.fr&gt;</span></a>
</li><li class="li-itemize">IJ : Judicael Bedouet <a href=""><span style="font-family:monospace">&lt;prenom.nom@onera.fr&gt;</span></a>
</li><li class="li-itemize">KL : Guillaume Dupont <a href=""><span style="font-family:monospace">&lt;prenom.nom@toulouse-inp.fr&gt;</span></a>
</li></ul><p>Pour la partie M&#XE9;thodes agiles (SCRUM), vous pouvez poser vos questions &#XE0;
Gilles FRANCOIS <a href=""><span style="font-family:monospace">&lt;pr&#XE9;nom.nom.e@thalesdigital.io&gt;</span></a> (quand le premier TD de la
mati&#XE8;re aura eu lieu).</p><p>Cette ann&#XE9;e les &#XE9;quipes de projet seront choisies au hasard... Sauf si les
groupes de TD arrivent &#XE0; former des 4 &#XE9;quipes avec comme r&#XE8;gle &#XAB;deux
personnes dans la m&#XEA;me &#XE9;quipe en PIM ne peuvent pas &#XEA;tre dans la m&#XEA;me &#XE9;quipe
en TOB &#XBB;.</p>
<h4 id="sec84" class="subsubsection">Notation du projet</h4>
<ul class="itemize"><li class="li-itemize">
Chaque &#XE9;tape du projet (d&#XE9;crite ci-apr&#XE8;s) sera prise en compte dans la
note du projet.</li><li class="li-itemize">&#XC0; la fin du projet, une d&#XE9;monstration, une pr&#XE9;sentation orale et un
	compte-rendu concernant l&#X2019;organisation du projet seront faits.
	<span style="font-weight:bold">Trois personnes seront tir&#XE9;es au sort</span>, chacune pour pr&#XE9;senter
	l&#X2019;un des aspects. Les autres membres de l&#X2019;&#XE9;quipe r&#XE9;pondront aux
	questions.</li><li class="li-itemize">Une partie de la note sera d&#XE9;finie par l&#X2019;&#XE9;quipe elle-m&#XEA;me.<p>Chaque membre de l&#X2019;&#XE9;quipe r&#XE9;partira un nombre de points &#XE9;gal &#XE0; 1 de moins
	que la taille de son &#XE9;quipe entre ses co&#XE9;quipiers. Chaque co&#XE9;quipier
	aura un nombre de points compris entre -1 et 3. Par exemple, pour une
	&#XE9;quipe de 6 personnes, chaque &#XE9;quipier pourra r&#XE9;partir 5 points sur
	ses co&#XE9;quipiers en donnant &#XE0; chacun un nombre de points entre -1 et 3.</p><p>La note d&#X2019;un &#XE9;tudiant sera donc : (note de l&#X2019;enseignant) + (moyenne
	des points attribu&#XE9;es par ses co&#XE9;quipiers - 1).</p></li></ul>
<h4 id="sec85" class="subsubsection">2024/01/26 : Jalon &#XAB; &#XC9;quipes constitu&#XE9;es &#XBB; (&#XE9;tudiants... Ou enseignants).</h4>
<h4 id="sec86" class="subsubsection">2024/02/05 : Jalon &#XAB; Cr&#XE9;ation projets Git &#XBB; (Xavier Cr&#XE9;gut).</h4>
<p>Cr&#XE9;ation des d&#XE9;p&#XF4;ts Git qui seront utilis&#XE9;s pour le projet. Les d&#XE9;p&#XF4;ts ne
peuvent &#XEA;tre cr&#XE9;&#XE9;s qu&#X2019;une fois les &#XE9;quipes constitu&#XE9;es.</p>
<h4 id="sec87" class="subsubsection">2024/02/10, d&#XE9;cal&#XE9; 2024/02/12 : Jalon &#XAB; Liste des sujets envisag&#XE9;s &#XBB; (&#XE9;quipes).</h4>
<p>Chaque &#XE9;quipe d&#XE9;posera sur le d&#XE9;p&#XF4;t Git, dans le dossier
<code>&#X200B;</code><code>livrables</code>, un document <code>&#X200B;</code><code>sujets</code><code>&#X200B;.&#X200B;</code><code>pdf</code> qui contiendra au
moins 4 sujets de projet envisag&#XE9;s, class&#XE9;s par ordre de pr&#XE9;f&#XE9;rence
d&#XE9;croissante de l&#X2019;&#XE9;quipe (le premier sujet est le sujet pr&#XE9;f&#XE9;r&#XE9; de l&#X2019;&#XE9;quipe).</p><p><span style="font-weight:bold">Les sujets propos&#XE9;s doivent &#XEA;tre d&#XE9;crits dans le document sujets.pdf
(tout en minuscules) qui doit &#XEA;tre d&#XE9;pos&#XE9; dans le dossier &#XAB; livrables &#XBB;</span></p><p>Chaque sujet doit &#XEA;tre d&#XE9;crit sur une page environ dans le but de convaincre
de la pertinence et de l&#X2019;int&#XE9;r&#XEA;t de votre projet. Vous devez consid&#XE9;rer que
ce document s&#X2019;adresse &#XE0; des clients potentiels, &#XE0; des <em>business angels</em>,
&#XE0; votre sup&#XE9;rieur hi&#XE9;rarchique...</p><p>Il doit y avoir suffisamment d&#X2019;information sur le projet pour que votre
enseignant puisse le comprendre et &#XE9;valuer le travail envisag&#XE9;. Ce document
sera le point de d&#XE9;part pour discuter de votre projet avec votre enseignant.
C&#X2019;est lui qui validera le sujet de votre projet au final.</p><p>En aucun cas il ne faut parler des solutions informatiques qui sera apport&#XE9;es
pour r&#XE9;aliser ce projet. Il ne s&#X2019;agit pas de d&#XE9;crire comment ce sujet sera
trait&#XE9; d&#X2019;un point de vue programmation mais ce qu&#X2019;il apportera &#XE0; ses
utilisateurs.</p><p>Quelques recommandations :
</p><ol class="enumerate" type=1><li class="li-enumerate">
Le projet doit &#XEA;tre suffisamment ambitieux puisque les &#XE9;quipes sont
de grande taille ! Vous ne devez pas pouvoir terminer le projet dans le
temps imparti. C&#X2019;est le but.</li><li class="li-enumerate">L&#X2019;application d&#XE9;velopp&#XE9;e devra &#XEA;tre pourvue d&#X2019;une interface graphique.</li><li class="li-enumerate">Vous ne ferez ni une application concurrente, ni une application
distribu&#XE9;e, ni une application client/serveur (ces notions seront vues en 2A).</li></ol><p>Attention, vous ne pouvez pas prendre un sujet qui serait du type &#XAB; bo&#XEE;te
&#XE0; jeux &#XBB; o&#XF9; chaque membre de l&#X2019;&#XE9;quipe s&#X2019;occuperait d&#X2019;un des jeux !</p><p>L&#X2019;enseignant &#XE9;valuera les sujets et donnera le feu vert &#XE0; l&#X2019;&#XE9;quipe pour
traiter l&#X2019;un des sujets (ou vous aidera &#XE0; construire un sujet adapt&#XE9; aux
attentes).</p><p><span style="font-weight:bold">Exemples de sujets propos&#XE9;s et choisis les ann&#XE9;es pass&#XE9;es</span>
</p><ul class="itemize"><li class="li-itemize">
Assistant d&#X2019;aide aux raffinages.
</li><li class="li-itemize">Application de proposition de repas
</li><li class="li-itemize">Gestion et maintenance d&#X2019;une maison intelligente
</li><li class="li-itemize">Jeu guid&#XE9; pour apprendre la programmation
</li><li class="li-itemize">Manuscript Manager (aide &#XE0; l&#X2019;&#XE9;criture d&#X2019;un roman)
</li><li class="li-itemize">R&#XE9;alisation d&#X2019;un RayTracer
</li><li class="li-itemize">Simulation de la propagation d&#X2019;un virus
</li><li class="li-itemize">Escape game
</li><li class="li-itemize">Application de gestion des cr&#XE8;ches
</li><li class="li-itemize">Programme d&#X2019;apprentissage musical
</li></ul>
<h4 id="sec88" class="subsubsection">2024/02/16 : Jalon &#XAB; S&#XE9;lection du sujet de
projet &#XBB; (enseignant responsable de l&#X2019;&#XE9;quipe de projet).</h4>
<p>L&#X2019;enseignant responsable de l&#X2019;&#XE9;quipe de projet communiquera le sujet retenu.</p>
<h4 id="sec89" class="subsubsection">2024/02/24 : Jalon &#XAB; Fonctionnalit&#XE9;s de l&#X2019;application &#XBB; (&#XE9;quipe).</h4>
<p>Il s&#X2019;agit de d&#XE9;crire les fonctionnalit&#XE9;s de l&#X2019;application que vous allez
d&#XE9;velopper dans un document appel&#XE9; fonctionnalites.pdf (nom &#XE0; respecter
imp&#XE9;rativement, nom tout en minuscules, sans accents), &#XE0; d&#XE9;poser dans le
dossier &#XAB; livrables &#XBB;. Il doit contenir :</p><ol class="enumerate" type=1><li class="li-enumerate">
une page de garde qui rappelle le num&#XE9;ro de l&#X2019;&#XE9;quipe, ses membres, le
	titre du projet, l&#X2019;objet du document...</li><li class="li-enumerate">l&#X2019;objectif g&#XE9;n&#XE9;ral du projet</li><li class="li-enumerate">une description des fonctionnalit&#XE9;s (attendues) de l&#X2019;application qui sera
d&#XE9;velopp&#XE9;e. Il s&#X2019;agit de d&#XE9;crire le service rendu (besoin) et non la
mani&#XE8;re dont ce service sera rendu (comment).</li><li class="li-enumerate">les interfaces utilisateur envisag&#XE9;es (esquisses r&#XE9;alis&#XE9;es &#XE0; main lev&#XE9;e ou
avec un outil de dessin).</li><li class="li-enumerate">plusieurs cas d&#X2019;usage (sc&#XE9;narios) pour comprendre les fonctionnalit&#XE9;s (et,
plus tard, valider l&#X2019;application d&#XE9;velopp&#XE9;e).</li><li class="li-enumerate">(facultatif) En annexe, lister les points durs, les points qui vous
	paraissent difficiles dans le projet propos&#XE9;.</li></ol><p>Il ne faut pas h&#XE9;siter &#XE0; mettre beaucoup de fonctionnalit&#XE9;s. Les &#XE9;tapes
suivantes consisteront &#XE0; les organiser, d&#XE9;finir des priorit&#XE9;s, etc. Tout ne
sera pas &#XE0; d&#XE9;velopper lors du projet long !</p><p><span style="font-weight:bold">Attention :</span>
Ici, on ne doit pas parler de programmation objet, d&#X2019;UML, de Java, etc.
On ne veut pas savoir comment sera r&#XE9;alis&#XE9;e l&#X2019;application mais bien
qu&#X2019;elles sont les les possibilit&#XE9;s qu&#X2019;elle offrira &#XE0; ses utilisateurs.</p><p>Ce document pourrait donc servir de trame pour le futur manuel
utilisateur. Il restera &#XE0; ajouter quelques captures d&#X2019;&#XE9;crans pour
remplacer les esquisses et les modes op&#XE9;ratoires tels qu&#X2019;ils ont &#XE9;t&#XE9;
finalement r&#XE9;alis&#XE9;s.
</p>
<h4 id="sec90" class="subsubsection">Semaines 13 &#XE0; 21 : R&#XE9;alisation du projet en 3 it&#XE9;rations.</h4>
<p>
Le projet sera organis&#XE9; en trois it&#XE9;rations de 2 semaines (pr&#XE9;c&#XE9;d&#XE9;es d&#X2019;une it&#XE9;ration
0).</p><p><span style="font-weight:bold">Attention : &#XE0; chaque fin d&#X2019;it&#XE9;ration, chaque membre de l&#X2019;&#XE9;quipe doit
d&#XE9;poser un tr&#XE8;s court rapport INDIVIDUEL qui d&#XE9;crit ce qu&#X2019;il a fait lors de
l&#X2019;it&#XE9;ration.</span> Ce rapport sera nomm&#XE9; <code class="verb">rapport#-$USER.pdf</code> (tout en
minuscules) o&#XF9; <code class="verb">$USER</code> est votre identifiant LDAP (votre login) et
<code>&#X200B;#</code> est le num&#XE9;ro de l&#X2019;it&#XE9;ration (1, 2 ou 3). Ce rapport doit &#XEA;tre
court et pr&#XE9;cis et lister les activit&#XE9;s r&#XE9;alis&#XE9;es (en indiquant le degr&#XE9;
d&#X2019;avancement) sur une page maximum. Les d&#XE9;tails de la r&#XE9;alisation seront
donn&#XE9;s dans le rapport g&#XE9;n&#XE9;ral.</p><p>&#XC0; la fin de chaque it&#XE9;ration, il faut aussi rendre le code complet de
l&#X2019;application dans un fichier <code>&#X200B;</code><code>source</code><code>&#X200B;#.&#X200B;</code><code>jar</code>, le manuel utilisateur
<code>&#X200B;</code><code>manuel</code><code>&#X200B;-&#X200B;</code><code>utilisateur</code><code>&#X200B;#.&#X200B;</code><code>pdf</code> et le rapport associ&#XE9;
<code>&#X200B;</code><code>rapport</code><code>&#X200B;#.&#X200B;</code><code>pdf</code>, <code>&#X200B;#</code> est le num&#XE9;ro de l&#X2019;it&#XE9;ration (1, 2 ou
3).</p><p>Le rapport documente votre projet. Il doit
inclure les &#XE9;l&#XE9;ments &#XE9;labor&#XE9;s suite aux s&#XE9;ances gestion de projet mais aussi
les &#XE9;l&#XE9;ments de conception (diagrammes UML). Les versions interm&#XE9;diaires de
ce rapport ne seront pas &#XE9;valu&#XE9;es. Le rapport &#XE0; la derni&#XE8;re it&#XE9;ration
constituera le rapport final.</p><p>Le manuel utilisateur explique comment utiliser le programme livr&#XE9;. Comme
pour le rapport, les version interm&#XE9;diaires ne seront pas &#XE9;valu&#XE9;es.</p><p>Attention &#XE0; bien v&#XE9;rifier que les .java sont pr&#XE9;sents dans l&#X2019;archive).</p><p>On peut construire un jar depuis Eclipse (il faut penser &#XE0;
s&#XE9;lectionner l&#X2019;inclusion des sources) ou depuis la ligne de commande.
Les options de la commande jar sont globalement les m&#XEA;mes que tar.</p>
<h4 id="sec91" class="subsubsection">Semaine 13 : 2024/03/25 au 2024/03/30, It&#XE9;ration 0</h4>
<p>.</p>
<h4 id="sec92" class="subsubsection">Semaines 14 &amp; 17 : 2024/04/02 au 2024/04/27, It&#XE9;ration 1</h4>
<p>.</p>
<h4 id="sec93" class="subsubsection">2024/04/27, Remise des livrables It&#XE9;ration 1 (rapports
individuels + code + manuel utilisateur + rapport g&#XE9;n&#XE9;ral).</h4>
<h4 id="sec94" class="subsubsection">Semaines 18 &amp; 19 : 2024/04/29 au 2024/05/13, It&#XE9;ration 2</h4>
<p>.</p>
<h4 id="sec95" class="subsubsection">2024/05/13, Fin It&#XE9;ration 2 : rapports individuels +
code + manuel utilisateur + rapport g&#XE9;n&#XE9;ral.</h4>
<h4 id="sec96" class="subsubsection">Semaines 20 &amp; 21 : 2024/05/14 au 2024/05/25, It&#XE9;ration 3</h4>
<p>.</p>
<h4 id="sec97" class="subsubsection">2024/05/25, Fin It&#XE9;ration 3 : rapports individuels + code +
manuel utilisateur + rapport g&#XE9;n&#XE9;ral).</h4>
<p>Vous devez rendre dans le dossier livrables de votre d&#XE9;p&#XF4;t SVN :
</p><ol class="enumerate" type=1><li class="li-enumerate">
Le rapport (rapport3.pdf) doit inclure :
<ol class="enumerate" type=a><li class="li-enumerate">
	Un rappel tr&#XE8;s succinct du sujet. Les d&#XE9;tails seront dans le manuel
	 utilisateur.</li><li class="li-enumerate">	Les principales fonctionnalit&#XE9;s (user stories ou epics) identifi&#XE9;es
	en pr&#XE9;cisant leur &#XE9;tat de r&#XE9;alisation (et dans quelle it&#XE9;ration elles
	 ont &#XE9;t&#XE9; faites pour celles qui sont termin&#XE9;es ou commenc&#XE9;es).</li><li class="li-enumerate">	Le d&#XE9;coupage de l&#X2019;application en sous-syst&#XE8;mes (en paquetages).</li><li class="li-enumerate">	Les diagrammes de classe qui donnent l&#X2019;architecture de votre
	 application. On pourra soit faire un diagramme de classe global,
	 soit un diagramme de classe par fonctionnalit&#XE9;.<p>	 On ne fera appara&#XEE;tre sur ces diagrammes que les informations
	 utiles pour comprendre l&#X2019;architecture. En particulier, il est
	 inutile de faire appara&#XEE;tre toutes les m&#XE9;thodes de toutes les
	 classes.</p></li><li class="li-enumerate">	La dynamique du syst&#XE8;me, toujours en s&#X2019;appuyant sur
	les diagrammes UML.</li><li class="li-enumerate">	Les principaux choix de conception et r&#XE9;alisation, les probl&#XE8;mes
	 rencontr&#XE9;s et les solutions apport&#XE9;es, etc.</li><li class="li-enumerate">	L&#X2019;organisation de l&#X2019;&#XE9;quipe et la mise en &#X153;uvre des m&#XE9;thodes
	 agiles.</li></ol><p>Il n&#X2019;y a pas de nombre de pages &#XE0; respecter. Il faut &#XEA;tre concis et
	pr&#XE9;cis. Sachez que ce rapport est le point d&#X2019;entr&#XE9;e sur votre code.
	Il doit permettre au lecteur de comprendre comment vous avez trait&#XE9;
	votre sujet et donc de savoir ce que vous avez fait sans avoir &#XE0;
	consulter le code. Si le lecteur est int&#XE9;ress&#XE9; par un aspect
	particulier, la lecture du rapport devrait l&#X2019;&#XE9;clairer sur ce qui a &#XE9;t&#XE9;
	fait, comment &#XE7;a a &#XE9;t&#XE9; fait et les sources &#XE0; lire pour avoir tous les
	d&#XE9;tails d&#X2019;implantation.</p></li><li class="li-enumerate">le manuel utilisateur : manuel-utilisateur3.pdf</li><li class="li-enumerate">les sources de votre projet : sources3.jar.</li></ol>
<h4 id="sec98" class="subsubsection">2024/05/29, 8h : Remise du support pour la pr&#XE9;sentation orale</h4>
<p>Le support de pr&#XE9;sentation utilis&#XE9; pour l&#X2019;oral du projet : presentation.pdf
(voir ci-dessous pour les consignes) doit &#XEA;tre d&#XE9;pos&#XE9; dans le dossier
livrables.</p>
<h4 id="sec99" class="subsubsection">2024/05/29, 8h : Points d&#X2019;&#XE9;quipe</h4>
<p>Modalit&#XE9; &#XE0; venir...</p>
<h4 id="sec100" class="subsubsection">2024/05/29 : Pr&#XE9;sentation orale.</h4>
<p>Pour la <span style="font-weight:bold">pr&#XE9;sentation orale</span>, le d&#XE9;roulement sera le suivant :
</p><ol class="enumerate" type=1><li class="li-enumerate">
14 minutes (maximum &#XE0; ne pas d&#XE9;passer !) &#XE0; utiliser pour :
<ul class="itemize"><li class="li-itemize">
	une d&#XE9;monstration de l&#X2019;application r&#XE9;alis&#XE9;e</li><li class="li-itemize">	une pr&#XE9;sentation technique du travail r&#XE9;alis&#XE9; (architecture, choix de
	 conception et r&#XE9;alisation, etc.). UML est certainement un outil
	 utile pour cette pr&#XE9;sentation...</li><li class="li-itemize">	une pr&#XE9;sentation de l&#X2019;organisation de l&#X2019;&#XE9;quipe et la mise en &#X153;uvre
	des m&#XE9;thodes agiles.</li></ul>
Vous devriez passer de 3 &#XE0; 6 minutes sur chacune de ces trois parties.<p><span style="font-weight:bold">Attention :</span> Les trois orateurs seront tir&#XE9;s au sort. Chacun doit
donc &#XEA;tre pr&#XEA;t &#XE0; pr&#XE9;senter chacune des trois parties.</p><p>Vous &#XEA;tes libres d&#X2019;organiser ces trois pr&#XE9;sentations dans l&#X2019;ordre que vous
souhaitez (m&#XEA;me s&#X2019;il para&#XEE;t logique de commencer par la d&#XE9;monstration car
	tous les membres du jury ne connaitront pas votre sujet).</p></li><li class="li-enumerate">10-15 minutes de questions/discussions.</li></ol><p>Il peut &#XEA;tre int&#XE9;ressant de commencer par la d&#XE9;monstration car c&#X2019;est
l&#X2019;occasion de rappeler le p&#XE9;rim&#XE8;tre du projet et comment il a &#XE9;t&#XE9; trait&#XE9; du
point de vue des utilisateurs. La pr&#XE9;sentation orale se concentrera sur
les aspects techniques et organisationnels du projet.</p><p>La <span style="font-weight:bold">pr&#XE9;sentation technique</span> doit &#XEA;tre technique ! Il n&#X2019;est pas utile
de nous d&#XE9;tailler le sujet (la d&#XE9;monstration l&#X2019;a fait). Ce qu&#X2019;il faut faire,
c&#X2019;est nous expliquer comment vous l&#X2019;avez trait&#XE9; : quels sont les choix faits ?
Quels sont les probl&#XE8;mes rencontr&#XE9;s et les solutions apport&#XE9;es. Nous vous
rappelons qu&#X2019;UML est un bon outil pour communiquer !</p><p>La <span style="font-weight:bold">gestion de projet</span> doit expliquer comment l&#X2019;&#XE9;quipe s&#X2019;est organis&#XE9;e,
les outils utilis&#XE9;s en accord avec ce qui a &#XE9;t&#XE9; pr&#XE9;sent&#XE9; en gestion de projet.</p><p><span style="font-weight:bold">Horaires de passage pour l&#X2019;oral</span></p><p>Toutes les &#XE9;quipes assistent &#XE0; toutes les pr&#XE9;sentations de leur groupe de TD.</p><p>L&#X2019;ordre de passage des &#XE9;quipes sera choisi au fur et &#XE0; mesure.</p>
<hr>
<a href="to-1sn-2023-deroulement-corrige029.html"><img src="previous_motif.svg" alt="Previous"></a>
<a href="to-1sn-2023-deroulement-corrige-index.html"><img src="contents_motif.svg" alt="Up"></a>
<a href="to-1sn-2023-deroulement-corrige031.html"><img src="next_motif.svg" alt="Next"></a>
</body>
</html>
