<!DOCTYPE html>
<html lang="fr">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=US-ASCII">
<meta name="generator" content="hevea 2.35">
<link rel="stylesheet" type="text/css" href="to-1sn-2023-deroulement-corrige.css">
<title>R&#XE9;ponses &#XE0; quelques questions fr&#XE9;quentes</title>
</head>
<body >
<a href="to-1sn-2023-deroulement-corrige030.html"><img src="previous_motif.svg" alt="Previous"></a>
<a href="to-1sn-2023-deroulement-corrige-index.html"><img src="contents_motif.svg" alt="Up"></a>
<hr>
<h3 id="sec102" class="subsection">1.4.1&#X2003;R&#XE9;ponses &#XE0; quelques questions fr&#XE9;quentes</h3>
<p><br>
</p><p><span style="font-weight:bold">Comment s&#X2019;identifier sur les QCM de TD ?</span></p><p>Pour vous identifier, nous utilisons votre num&#XE9;ro Apog&#XE9;e que vous trouvez sur
plan&#XE8;te dans <em>Mon dossier Web</em> ou <em>Mes notes</em>. C&#X2019;est un 
num&#XE9;ro a 8 chiffres qui commence par leur ann&#XE9;e de premi&#XE8;re inscription.
On utilisera les 5 derniers chiffres et on codera un chiffre par ligne en haut
du QCM. Le chiffre des unit&#XE9;s est sur la derni&#XE8;re ligne : le nombre se lit de
haut en bas.</p><p>Par exemple, si votre num&#XE9;ro Apog&#XE9;e est 20230471, les 5 derniers chiffres sont
30471. Il faut donc cocher le 3 sur la premi&#XE8;re ligne, le 0 sur la deuxi&#XE8;me,
le 4 sur la troisi&#XE8;me, le 7 sur la quatri&#XE8;me et le 1 sur la derni&#XE8;re.</p><p>Il est aussi important de mettre votre nom (en majuscules !) et votre pr&#XE9;nom
dans le cadre pr&#XE9;vu &#XE0; cet effet.</p><p><br>
</p><p><span style="font-weight:bold">Comment cocher une case sur un QCM ?</span></p><p>Il faut utiliser un stylo noir ou bleu, pas de rouge, pas de vert, pas de
crayon &#XE0; papier. </p><p>Il faut mettre suffisamment de mati&#XE8;re dans la case (croix large, case
noirci).</p><p><br>
</p><p><span style="font-weight:bold">Comment corriger une case coch&#XE9;e par erreur sur un QCM ?</span></p><p>Il faut utiliser du blanc pour effacer la case et son contenu et, surtout, il
ne faut pas redessiner la case. Ceci conduirait certainement &#XE0; la consid&#XE9;r&#XE9;e
comme coch&#XE9;e.</p><p><span style="font-weight:bold">Comment v&#XE9;rifier que j&#X2019;ai r&#XE9;ussi &#XE0; mettre mes fichiers sur le
Gitlab ?</span></p><p>Plusieurs solutions sont possibles :
</p><ol class="enumerate" type=1><li class="li-enumerate">
Vous pouvez taper la commande (&#XE0; la racine de votre d&#XE9;p&#XF4;t) :
	<code class="verb">git status</code></li><li class="li-enumerate">Vous pouvez utiliser un navigateur pour aller sur Gitlab, sur votre projet
et v&#XE9;rifier que tous les fichiers y sont, avec vos derni&#XE8;res
	modifications.</li><li class="li-enumerate">Vous pouvez faire une nouvelle copie locale de votre d&#XE9;p&#XF4;t (<code class="verb">git clone</code>)
	dans un nouveau dossier (par exemple /tmp) et voir ce qui remonte.
	Vous pouvez en profiter pour v&#XE9;rifier que le projet compile, les tests
	passent, etc.</li><li class="li-enumerate">...</li></ol><hr>
<a href="to-1sn-2023-deroulement-corrige030.html"><img src="previous_motif.svg" alt="Previous"></a>
<a href="to-1sn-2023-deroulement-corrige-index.html"><img src="contents_motif.svg" alt="Up"></a>
</body>
</html>
